src/main/resources/delete-student-request.xml

<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:us="sistemas-distribuidos/soap-api"
>
    <soapenv:Header />
    <soapenv:Body>
        <us:deleteStudentRequest>
            <us:id>2</us:id>
        </us:deleteStudentRequest>
    </soapenv:Body>
</soapenv:Envelope>